using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Chess
{
    using Pictures;
    public partial class Rules : Form
    {
        private String _generalRules; // החוקים הכללים של המשחק
        public Rules()
        {
            InitializeComponent(); 
            // החוקים הכלליים
            this._generalRules = "השחקן בכלים הלבנים (להלן: \"הלבן\") הוא הראשון לשחק. כל שחקן מניע בתורו את אחד הכלים שברשותו (כלי אחד בלבד, להוציא במקרה של הצרחה), כאשר לכל כלי אופן תנועה הייחודי לו, כמפורט לעיל, וכך עד להכרעה. השחקן יכול להזיז כל כלי בתורו ולהזיזו לאן שרק ירצה, ובלבד שלא יעבור על כללי תנועת הכלים המפורטים לעיל. כמו כן, אם המלך של שחקן מסוים נחשף לאיום מצד כלי של היריב (מצב המכונה \"שח\"), חובה על השחקן לעשות כל שביכולתו כדי לבטל את המצב הזה. אם לא יצליח לבטל את האיום, יפסיד במשחק, במצב המכונה מט. כל מהלך שאינו מביא לכך באופן מיידי לא יהיה חוקי. בנוסף לכך, כל מהלך שיביא באופן מיידי לכך שהמלך של השחקן המשחק יימצא במצב של שח גם אינו חוקי (המלך הוא הכלי היחיד שאסור להעמידו במכוון תחת איום של כלי אחר).";
            
            // תמונת המלך וטקסט החוקים בעבורו
            this.pictureBoxKing.Image = Pieces_Pictures.BlackKing;
            this.pictureBoxKing.Tag = "המלך הוא אומנם הכלי הכי חשוב במשחק, אבל הוא נע באיטיות ובכבדות - משבצת אחת בלבד בכל פעם, לכל כיוון שיחפוץ. גם המלך יכול להכות כלי יריב במשבצת סמוכה, ונחסם על ידי כלי מצבאו שלו.";

            // תמונת המלכה וטקסט החוקים בעבורה
            this.pictureBoxQueen.Image = Pieces_Pictures.BlackQueen;
            this.pictureBoxQueen.Tag = "המלכה נחשבת לכלי החזק ביותר על הלוח. היא יכולה לנוע גם בקווים ישרים (כמו הצריח) וגם באלכסון (כמו הרץ), ויכולה לנוע משבצת אחת או מספר משבצות - עד קצה גבול הלוח. אבל אפילו המלכה לא יכולה לדלג על כלים. אם היא נתקלת בכלי אויב, היא יכולה להכות אותו - ולהתייצב במקומו.";

            // תמונת הפרש וטקסט החוקים בעבורו
            this.pictureBoxKnight.Image = Pieces_Pictures.BlackKnight;
            this.pictureBoxKnight.Tag = "הפרש הוא המיוחד והמעניין בכלי השחמט. הילוכו מזכיר צורת ריש - קודם שתי משבצות בקו ישר (קדימה, אחורה, ימינה או שמאלה) ולאחר מכן משבצת אחת בפניה. בנוסף יש לפרש תכונה מיוחדת - הוא מדלג מעל כלים - בין אם אלו כלי היריב או כל כלי מהצבא שלו. אם הפרש מסיים את מסעו בערוגה שבה נמצא כלי אויב, הוא יכול להכותו - ולהתייצב במקומו. כשהפרש מדלג מעל כלי הוא אינו מכה אותו.";

            // תמונת הרץ וטקסט החוקים בעבורו
            this.pictureBoxBishop.Image = Pieces_Pictures.BlackBishop;
            this.pictureBoxBishop.Tag = "הרץ נע באלכסון - לכל ארבעת הכיוונים האפשריים. הוא יכול לנוע משבצת אחת או מספר משבצות (עד לקצה גבול הלוח). גם הרץ לא יכול לדלג על כלי אחר. אם הוא נתקל בכלי אויב, הוא יכול להכותו - ולהתייצב במקומו.";

            // תמונת הצריח וטקסט החוקים בעבורו
            this.pictureBoxRook.Image = Pieces_Pictures.BlackRook;
            this.pictureBoxRook.Tag = "הצריח נע בקווים ישרים - קדימה ואחורה, ימינה ושמאלה. הוא יכול לנוע משבצת אחת או מספר משבצות (עד לקצה גבול הלוח), אבל הצריח איננו יכול יכול לדלג על כלי אחר. אם הוא נתקל בכלי אויב, הוא יכול להכותו - ולהתייצב במקומו.";

            // תמונת החייל וטקסט החוקים בעבורו
            this.pictureBoxPawn.Image = Pieces_Pictures.BlackPawn;
            this.pictureBoxPawn.Tag = "הרגלים הם הכלים הזוטרים - שמונה במספר לכל צד. תנועת הרגלי פשוטה - הוא נוסע צעד אחד קדימה (כמובן שהרגלים הלבנים נוסעים לכיוון המחנה השחור, ואילו הרגלים השחורים - לכיוון המחנה הלבן). בניגוד לכלים האחרים, הרגלי מכה בצורה אחרת - בצעד אחד קדימה ובאלכסון, ימינה או שמאלה. אם יש כלי חבר או אויב במשבצת שלפני הרגלי, אז הרגלי לא יכול להתקדם. מלבד זאת לרגלי תכונה מעניינת נוספת. במסעו הראשון, כשהוא עדיין במיקומו המקורי, יש לרגלי הזכות לנסוע קדימה שני צעדים במקום אחד. אבל התכונה המרתקת ביותר של הרגלי באה לידי ביטוי כשהרגלי מתקדם עד לקצה הלוח (כלומר רגלי לבן מגיע לשורה השמינית או רגלי שחור מגיע לשורה הראשונה). כשהרגלי מגיע לקצה הלוח הוא מקבל העלאה בדרגה (קידום) ויכול לבחור להפוך לכל כלי אחר כרצונו - מלבד מלך. הדבר נקרא הכתרה. בדרך כלל מכתירים את הרגלי למלכה - שהיא הכלי החזק ביותר.";

            // חוק ה en passant 
            this.button1.Tag = "כאשר רגלי מבצע מסע כפול, יכול רגלי אחר להכות אותו כאילו עבר רק משבצת אחת. המהלך תקף רק לתור הבא ,זהו למעשה המהלך היחיד בשחמט שניתן לעשות רק בתור הקרוב ולא לאחר מכן.";
            // חוק ההכתרה
            this.button2.Tag = "בשחמט, הכתרה היא מצב בו רגלי מגיע לשורה האחרונה בלוח (שורה 8 ללבן, שורה 1 לשחור). במצב זה, הרגלי מוסר מהלוח ובמקומו מציבים כלי אחר, מאותו צבע (לפי בחירת השחקן): מלכה, צריח, רץ או פרש. ניתן להציב כלי גם אם הוא עוד לא הוכה. בדרך כלל השחקן בוחר להציב מלכה, מאחר שהיא הכלי החזק ביותר.";
            // חוק ההצרחה
            this.button3.Tag = "במשחק השחמט, הצרחה היא מהלך משותף של המלך והצריח הנחשב כמסע אחד ומתבצע בשני שלבים:\nהמלך מוזז שתי ערוגות לכיוון הצריח והצריח מוזז לערוגה הצמודה למלך ומעבר לו זהו המקרה היחיד בו מוזזים שני כלים ובו המלך זז יותר מערוגה אחת, במסע אחד.\nהצרחה תתבצע בתנאים הבאים:\nהמלך והצריח לא הוזזו כלל מערוגותיהם הטבעיות. המלך לא נמצא באיום שח באותו רגע. המלך לא יימצא באיום שח בתום ההצרחה. המלך אינו עובר על פני ערוגות המאויימות על ידי כלי היריב. ערוגות אלו כוללות את ערוגת הכניסה של המלך בהצרחה.\nאין כלי מפריד בין המלך לצריח.\nהצריח והמלך נמצאים באותה שורה. ";
        }

        // כאשר לוחצים על מקום תמונה (מאורע לחיצה) – על תמונה, הפונקציה מסמנת את הכפתור ומעדכנת את תיבת הטקסט העשירה להיות בטקסט של התג  המתאים לפי התמונה .
        private void PictureBoxClicked(object sender, EventArgs e)
        {
            this.UncheckPictureBoxes(); // מבטלת סימונים קודמים

            var control = ((Control)sender); // שימת הלחצן
            control.BackColor = SystemColors.Highlight; // הפיכתו למסומן
            this.rtbMainBox.Text = ((string)control.Tag); // הטקסט של תיבת הטקסט הופך להיות הטקסט של הכלי שנלחץ עליו
        }

        // לחיצה על מסך החוקים בכל מקום שהוא מבטלת סימונים ומחזירה להציג את החוקים הכלליים
        private void Rules_Click(object sender, EventArgs e)
        {
            this.UncheckPictureBoxes(); // ביטול סימון
            this.rtbMainBox.Text = this._generalRules; // חוקים רגילים
        }
        // הפונקציה מבטלת את הסימון של ההתמונות .
        private void UncheckPictureBoxes()
        {
            foreach (Control control in this.Controls) // עבור כל לחצן
            {
                control.BackColor = SystemColors.Control; // החזרה למצב הרגיל ללא סימון
            }
        }

        // פתיחת קישור באינטרנט
        private void linkLabel1_LinkClicked(object sender, LinkLabelLinkClickedEventArgs e)
        {
            System.Diagnostics.Process.Start("https://www.ichess.co.il/article.html#!id=8"); 
        }

        // פתיחת קישור באינטרנט
        private void linkLabel2_LinkClicked(object sender, LinkLabelLinkClickedEventArgs e)
        {
            System.Diagnostics.Process.Start("http://he.wikipedia.org/wiki/%D7%A9%D7%97%D7%9E%D7%98");
        }



    }
}
